tap "sanemat/font"
tap "adoptopenjdk/openjdk"

# common
brew "fish"
brew "neovim"
brew "arp-scan"
brew "python"
brew "gcc"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "inetutils"
brew "nkf"
brew "nmap"
brew "wget"
brew "tmux"

# useful tools
brew "asdf"
brew "direnv"
brew "ansible"
brew "gettext"
brew "jq"
brew "go"
brew "w3m"
brew "gradle"
brew "sbt"
brew "poppler"
brew "helm"
brew "ghcup"
brew "poetry"

# advanced tools
brew "bats"

# more advanced
#tap "lampepfl/brew"
#brew "llvm@6"
#brew "idris"
#brew "elm"
#brew "scala"
#brew "opam"
#brew "purescript"
#brew "lampepfl/brew/dotty"
#brew "subversion"
#brew "haskell-stack"
